#ifndef _QDPSHMSERVER_H_
#define _QDPSHMSERVER_H_
#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000
#include "ShmServer.h"


class QdpShmServer : CShmServer
{
public:

	/************************************************************************/
	/*  构造函数,同时开辟共享内存											*/
	/************************************************************************/
	QdpShmServer(CServiceName *pName,int number,int size);

	/************************************************************************/
	/*  数据保存															*/
	/************************************************************************/
	int QdpDataSave(CFTDDepthMarketDataField *filed);

	/************************************************************************/
	/*  设置共享内存空间													*/
	/************************************************************************/
	int QdpShmSet();

	/**析构函数，释放占用的资源
	*/
	virtual ~QdpShmServer();


private:
	/************************************************************************/
	/*  只能容纳一条记录空间，用来存放最新的								*/
	/************************************************************************/
	int QdpShmWrite(CFTDDepthMarketDataField *filed);

	/************************************************************************/
	/*  往指定位置插入数据													*/
	/************************************************************************/
	int QdpShmWrite(CFTDDepthMarketDataField *filed,unsigned int key);

	/************************************************************************/
	/* 计算hash值				                                            */
	/************************************************************************/
	unsigned int QdpHashKey(const char *key);

	/************************************************************************/
	/* 获取hashkey                                                          */
	/************************************************************************/
	unsigned int BKDRHash(const char *str);

	void *m_baseshmadr;

	int count;
	
	//位置存储
	CInstrumentDataMap  *SInstrumentIDPos;
};
#endif